Ibrahim-Touny/LockEn_STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  **************************
  * @file           : main.c
  * @brief          : Card + Fingerprint + Password Access Control
  *                   - RFID (MFRC522) admin card registration & check
  *                   - R307 fingerprint enrollment & verification
  *                   - Keypad password entry
  *                   - Solenoid lock control (PB2)
  *                   - Reset button (PB1) to re-run setup
  *                   - Buzzer (PC15) for audible feedback
  *                   - MPU6050 tamper-detect alarm (I2C2)
  **************************
  */
/* USER CODE END Header */

#include "stdio.h"
#include "string.h"
#include "main.h"
#include "i2c-lcd.h"
#include "rc522.h"
#include "R307.h"
#include "mpu6050.h"
#include "ESP8266.h"

/* ── MPU6050 motion / tamper detection tuning ───────────────────────────── */
/* For AFS=8G (4096 LSB/g) and FS=1000 dps (32.8 LSB/dps).
 * Increase if false triggers, decrease if it never trips.                  */
#define MPU_ACCEL_MOVED_THRESHOLD   1200U   /* ~0.29 g */
#define MPU_GYRO_MOVED_THRESHOLD    2000U   /* ~61 dps */
#define MPU_POLL_PERIOD_MS          200U    /* poll rate while idle */
#define TAMPER_ALARM_MS             1500U   /* buzzer alarm duration on tamper */

/* ── Peripheral handles ─────────────────────────────────────────────────── */
I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;
SPI_HandleTypeDef hspi1;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart6;

/* ── RFID working buffers ───────────────────────────────────────────────── */
uint8_t status;           /* MFRC522 status return */
uint8_t str[MAX_LEN];     /* raw bytes from RFID request/anticoll */
uint8_t sNum[5];          /* scanned card UID */

/* ── Configuration ──────────────────────────────────────────────────────── */
#define PASSWORD_LEN     4
#define MAX_ATTEMPTS     3
#define NUM_FINGERS      1

/* ── GPIO aliases (match your CubeMX labels) ────────────────────────────── */
/* Reset button: PB1, active LOW (internal pull-up) */
#define RESET_BTN_PORT   GPIOB
#define RESET_BTN_PIN    GPIO_PIN_1

/* Solenoid relay: PB2, active HIGH = unlock */
#define SOLENOID_PORT    GPIOB
#define SOLENOID_PIN     GPIO_PIN_2

/* Buzzer: PC15, active HIGH = ON */
#define BUZZER_PORT      GPIOC
#define BUZZER_PIN       GPIO_PIN_15

/* ── Registered credential storage ──────────────────────────────────────── */
uint8_t AUTH_CARD[5]                      = {0};
char    SAVED_PASSWORD[PASSWORD_LEN + 1]  = {0};

/* ── WiFi web mirror configuration ─────────────────────────────────────── */
#define WIFI_AP_SSID         "LockEn-LCD"
#define WIFI_AP_PASSWORD     "LockEn123"
#define WIFI_AP_CHANNEL      1U
#define WIFI_WEB_PORT        80U

static char lcd_rows[2][17] = {{'\0'}, {'\0'}};
static bool wifi_web_started = false;

/* ── Private prototypes ─────────────────────────────────────────────────── */
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART6_UART_Init(void);

/* ── Small helper: |int16| → uint16 ─────────────────────────────────────── */
static uint16_t u16_abs_i16(int16_t v)
{
    return (v < 0) ? (uint16_t)(-v) : (uint16_t)v;
}

static void lcd_cache_row(uint8_t row, const char *s)
{
    if (row > 1)
        return;

    memset(lcd_rows[row], ' ', 16);
    lcd_rows[row][16] = '\0';

    if (s == NULL)
        return;

    size_t len = strlen(s);
    if (len > 16)
        len = 16;
    memcpy(lcd_rows[row], s, len);
}

static void lcd_clear_tracked(void)
{
    lcd_cache_row(0, "");
    lcd_cache_row(1, "");
    lcd_clear();
}

#define lcd_clear lcd_clear_tracked

static void Wifi_Web_SendPage(uint8_t linkId)
{
    char page[_MAX_SEND_BYTES];
    int written = snprintf(
        page,
        sizeof(page),
        "HTTP/1.1 200 OK\r\n"
        "Content-Type: text/html; charset=utf-8\r\n"
        "Cache-Control: no-store\r\n"
        "Connection: close\r\n\r\n"
        "<!doctype html><html><head><meta charset='utf-8'>"
        "<meta http-equiv='refresh' content='1'>"
        "<meta name='viewport' content='width=device-width, initial-scale=1'>"
        "<title>LockEn LCD</title>"
        "<style>body{font-family:monospace;background:#0f172a;color:#e2e8f0;margin:0;padding:20px}"
        ".panel{max-width:680px;margin:0 auto;background:#111827;border:1px solid #334155;border-radius:16px;padding:20px}"
        ".row{display:flex;justify-content:space-between;gap:12px;padding:10px 12px;margin:10px 0;background:#1f2937;border-radius:10px;white-space:pre}"
        ".label{color:#94a3b8}.lcd{font-size:18px;line-height:1.5}</style></head><body>"
        "<div class='panel'><h1>LockEn LCD Mirror</h1><p>SSID: %s</p><p>Connect to the AP, then keep this page open.</p>"
        "<div class='lcd'><div class='row'><span class='label'>Row 1</span><span>%s</span></div>"
        "<div class='row'><span class='label'>Row 2</span><span>%s</span></div></div></div></body></html>",
        WIFI_AP_SSID,
        lcd_rows[0],
        lcd_rows[1]);

    if (written > 0)
    {
        if ((size_t)written >= sizeof(page))
            written = (int)(sizeof(page) - 1);
        Wifi_TcpIp_SendDataTcp(linkId, (uint16_t)written, (uint8_t *)page);
    }

    Wifi_TcpIp_Close(linkId);
}

static void Wifi_Web_Poll(void)
{
    if (!wifi_web_started)
        return;

    if (Wifi.RxIndex == 0)
        return;

    char *ipd = strstr((char *)Wifi.RxBuffer, "+IPD,");
    if (ipd == NULL)
        return;

    uint8_t linkId = 0;
    char *cursor = ipd + 5;
    if (Wifi.TcpIpMultiConnection)
    {
        linkId = (uint8_t)strtoul(cursor, &cursor, 10);
        if (*cursor != ',')
            return;
        cursor++;
    }

    (void)strtoul(cursor, &cursor, 10);
    cursor = strchr(cursor, ':');
    if (cursor == NULL)
        return;
    cursor++;

    if (strncmp(cursor, "GET ", 4) != 0)
        return;

