Ibrahim-Touny/LockEn_STM32/Core/Src/main.c
    Wifi_Web_SendPage(linkId);
    Wifi_RxClear();
}

static bool Wifi_Web_Start(void)
{
    wifi_web_started = false;
    Wifi_RxClear();

    if (Wifi_Init() == false)
        return false;

    if (Wifi_SetMode(WifiMode_SoftAp) == false)
        return false;

    if (Wifi_SoftAp_Create((char *)WIFI_AP_SSID,
                           (char *)WIFI_AP_PASSWORD,
                           WIFI_AP_CHANNEL,
                           WifiEncryptionType_WPA2_PSK,
                           1,
                           false) == false)
        return false;

    if (Wifi_TcpIp_SetMultiConnection(true) == false)
        return false;

    if (Wifi_TcpIp_SetEnableTcpServer(WIFI_WEB_PORT) == false)
        return false;

    wifi_web_started = true;
    Wifi_RxClear();
    return true;
}

/* ─────────────────────────────────────────────────────────────────────────
 *  BUZZER HELPERS
 * ───────────────────────────────────────────────────────────────────────── */
static inline void Buzzer_On(void)
{
    HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_SET);
}

static inline void Buzzer_Off(void)
{
    HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_RESET);
}

/* Single short tick — used for keypad feedback / card scan confirm */
static void Buzzer_Beep(uint16_t ms)
{
    Buzzer_On();
    HAL_Delay(ms);
    Buzzer_Off();
}

/* Two short beeps — "step OK" (card matched, finger matched) */
static void Buzzer_BeepOK(void)
{
    Buzzer_Beep(80);
    HAL_Delay(80);
    Buzzer_Beep(80);
}

/* Long beep — "access granted" */
static void Buzzer_BeepGranted(void)
{
    Buzzer_Beep(400);
}

/* Three short beeps — "access denied / error" */
static void Buzzer_BeepDenied(void)
{
    for (int i = 0; i < 3; i++)
    {
        Buzzer_Beep(120);
        HAL_Delay(100);
    }
}

/* Pulsing alarm — "tamper detected" */
static void Buzzer_Alarm(uint16_t total_ms)
{
    uint32_t start = HAL_GetTick();
    while ((HAL_GetTick() - start) < total_ms)
    {
        Buzzer_On();
        HAL_Delay(100);
        Buzzer_Off();
        HAL_Delay(100);
    }
}

/* ─────────────────────────────────────────────────────────────────────────
 *  LCD HELPERS
 * ───────────────────────────────────────────────────────────────────────── */
/* Send a string capped/padded to exactly 16 chars so leftovers are cleared */
void lcd_send_string_safe(const char *s)
{
    char buf[17];
    memset(buf, ' ', 16);
    buf[16] = '\0';

    if (s == NULL)
        s = "";

    size_t len = strlen(s);
    if (len > 16)
        len = 16;
    memcpy(buf, s, len);

    lcd_send_string(buf);
}

/* Convenience: write 16-char-safe string at (row, col=0) */
static void lcd_show(uint8_t row, const char *s)
{
    if (row > 1)
        return;

    lcd_cache_row(row, s);
    lcd_put_cur(row, 0);
    lcd_send_string_safe(s);
}

/* Show idle prompt */
static void lcd_show_idle(void)
{
    lcd_clear();
    lcd_show(0, "Scan your card");
    lcd_show(1, "");
}

/* ─────────────────────────────────────────────────────────────────────────
 *  KEYPAD
 * ───────────────────────────────────────────────────────────────────────── */
/* Returns the pressed key character, or 0x01 if none */
char read_keypad(void)
{
    /* Row 1 */
    HAL_GPIO_WritePin(R1_GPIO_Port, R1_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(R2_GPIO_Port, R2_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R3_GPIO_Port, R3_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R4_GPIO_Port, R4_Pin, GPIO_PIN_SET);
    if (!HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin)) { while (!HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin)); return '1'; }
    if (!HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin)) { while (!HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin)); return '2'; }
    if (!HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin)) { while (!HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin)); return '3'; }
    if (!HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin)) { while (!HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin)); return 'A'; }

    /* Row 2 */
    HAL_GPIO_WritePin(R1_GPIO_Port, R1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R2_GPIO_Port, R2_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(R3_GPIO_Port, R3_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R4_GPIO_Port, R4_Pin, GPIO_PIN_SET);
    if (!HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin)) { while (!HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin)); return '4'; }
    if (!HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin)) { while (!HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin)); return '5'; }
    if (!HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin)) { while (!HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin)); return '6'; }
    if (!HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin)) { while (!HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin)); return 'B'; }

    /* Row 3 */
    HAL_GPIO_WritePin(R1_GPIO_Port, R1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R2_GPIO_Port, R2_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R3_GPIO_Port, R3_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(R4_GPIO_Port, R4_Pin, GPIO_PIN_SET);
    if (!HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin)) { while (!HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin)); return '7'; }
    if (!HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin)) { while (!HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin)); return '8'; }
    if (!HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin)) { while (!HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin)); return '9'; }
    if (!HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin)) { while (!HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin)); return 'C'; }

    /* Row 4 */
    HAL_GPIO_WritePin(R1_GPIO_Port, R1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R2_GPIO_Port, R2_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R3_GPIO_Port, R3_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(R4_GPIO_Port, R4_Pin, GPIO_PIN_RESET);
    if (!HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin)) { while (!HAL_GPIO_ReadPin(C1_GPIO_Port, C1_Pin)); return '*'; }
    if (!HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin)) { while (!HAL_GPIO_ReadPin(C2_GPIO_Port, C2_Pin)); return '0'; }
    if (!HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin)) { while (!HAL_GPIO_ReadPin(C3_GPIO_Port, C3_Pin)); return '#'; }
    if (!HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin)) { while (!HAL_GPIO_ReadPin(C4_GPIO_Port, C4_Pin)); return 'D'; }

    return 0x01;
}

