Ibrahim-Touny/LockEn_STM32/Core/Src/main.c
/* ── Read a password from keypad ────────────────────────────────────────── */
/* '#' confirms entry, '*' is backspace, digits fill the buffer.            */
/* Each keypress beeps briefly and shows '*' on row 1.                      */
uint8_t get_password(char *entered, uint8_t max_len)
{
    uint8_t idx = 0;
    memset(entered, 0, max_len + 1);

    lcd_show(1, "");

    while (1)
    {
        char key = read_keypad();

        if (key == 0x01)
        {
            Wifi_Web_Poll();
            continue;          /* no key */
        }

        Buzzer_Beep(40);                    /* keypress click */

        if (key == '#')
        {
            if (idx == 0) continue;         /* nothing typed yet */
            entered[idx] = '\0';
            return 1;
        }
        else if (key == '*')
        {
            if (idx > 0)
            {
                idx--;
                entered[idx] = '\0';
                lcd_put_cur(1, idx);
                lcd_send_data(' ');
                lcd_put_cur(1, idx);
            }
        }
        else if (idx < max_len)
        {
            entered[idx] = key;
            idx++;
            lcd_put_cur(1, idx - 1);
            lcd_send_data('*');
        }

        HAL_Delay(120);                     /* debounce */
    }
}

/* ─────────────────────────────────────────────────────────────────────────
 *  SOLENOID
 * ───────────────────────────────────────────────────────────────────────── */
void Solenoid_Unlock(void)
{
    HAL_GPIO_WritePin(SOLENOID_PORT, SOLENOID_PIN, GPIO_PIN_SET);
}

void Solenoid_Lock(void)
{
    HAL_GPIO_WritePin(SOLENOID_PORT, SOLENOID_PIN, GPIO_PIN_RESET);
}

/* ─────────────────────────────────────────────────────────────────────────
 *  RESET BUTTON
 * ───────────────────────────────────────────────────────────────────────── */
uint8_t ResetButton_IsPressed(void)
{
    return (HAL_GPIO_ReadPin(RESET_BTN_PORT, RESET_BTN_PIN) == GPIO_PIN_RESET);
}

/* ─────────────────────────────────────────────────────────────────────────
 *  SETUP PHASES
 * ───────────────────────────────────────────────────────────────────────── */
void Setup_RegisterCard(void)
{
    lcd_clear();
    lcd_show(0, "Scan Admin Card");
    lcd_show(1, "to Register...");

    while (1)
    {
        Wifi_Web_Poll();

        status = MFRC522_Request(PICC_REQIDL, str);
        if (status != MI_OK) { HAL_Delay(200); continue; }

        status = MFRC522_Anticoll(str);
        if (status != MI_OK) { HAL_Delay(200); continue; }

        memcpy(AUTH_CARD, str, 5);

        Buzzer_BeepOK();

        lcd_clear();
        lcd_show(0, "Card Saved!");

        char uidMsg[17];
        snprintf(uidMsg, sizeof(uidMsg), "%u %u %u %u %u",
                 AUTH_CARD[0], AUTH_CARD[1],
                 AUTH_CARD[2], AUTH_CARD[3], AUTH_CARD[4]);
        lcd_show(1, uidMsg);

        HAL_Delay(2000);
        return;
    }
}

void Setup_EnrollFingerprints(void)
{
    lcd_clear();
    lcd_show(0, "Enrolling FP...");

    for (int i = 1; i <= NUM_FINGERS; i++)
    {
        char msg[17];
        snprintf(msg, sizeof(msg), "Enroll Finger %d", i);
        lcd_show(0, msg);

        HAL_StatusTypeDef result;
        int retries = 3;

        do
        {
            Wifi_Web_Poll();
            result = R307_Enroll(i);
        } while (result != HAL_OK && --retries > 0);

        if (result == HAL_OK)
        {
            lcd_show(0, "Enroll OK!");
            Buzzer_BeepOK();
        }
        else
        {
            lcd_show(0, "Enroll Failed!");
            Buzzer_BeepDenied();
        }

        Wifi_Web_Poll();
        HAL_Delay(1000);
    }
}

void Setup_RegisterPassword(void)
{
    lcd_clear();
    lcd_show(0, "Set Password:");
    lcd_show(1, "Then press #");
    HAL_Delay(1500);

    lcd_show(0, "Enter Password:");
    get_password(SAVED_PASSWORD, PASSWORD_LEN);

    Buzzer_BeepOK();
    lcd_clear();
    lcd_show(0, "Password Saved!");
    HAL_Delay(1500);
}

/* ─────────────────────────────────────────────────────────────────────────
 *  MPU6050 TAMPER CHECK
 *  Reads accel + gyro and compares to baseline. Returns 1 if motion exceeds
 *  thresholds. Baseline is rolled forward on each call.
 * ───────────────────────────────────────────────────────────────────────── */
static uint8_t MPU_CheckTamper(int16_t accel_prev[3], int16_t gyro_prev[3])
{
    int16_t accel_now[3], gyro_now[3];
    uint8_t moved = 0;

    MPU6050_getAccelValue(&hi2c2, accel_now);
    MPU6050_getGyroValue(&hi2c2, gyro_now);

    for (int i = 0; i < 3; i++)
    {
        if (u16_abs_i16((int16_t)(accel_now[i] - accel_prev[i])) > MPU_ACCEL_MOVED_THRESHOLD) moved = 1;
        if (u16_abs_i16((int16_t)(gyro_now[i]  - gyro_prev[i]))  > MPU_GYRO_MOVED_THRESHOLD)  moved = 1;
        accel_prev[i] = accel_now[i];
        gyro_prev[i]  = gyro_now[i];
    }
    return moved;
}

/* ════════════════════════════════════════════════════════════════════════
 *  MAIN
 * ════════════════════════════════════════════════════════════════════════ */
int main(void)
{
    /* ── Core HAL + clocks + peripherals ─────────────────────────────── */
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_I2C2_Init();
    MX_SPI1_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART6_UART_Init();
    DWT_Delay_Init();

    /* Make sure outputs are in a safe state */
    Buzzer_Off();
    Solenoid_Lock();

    /* ── RFID module init ────────────────────────────────────────────── */
    MFRC522_Init();
    HAL_Delay(500);

    /* ── I2C1 bus reset (prevents LCD lockup at boot) ────────────────── */
    __HAL_RCC_I2C1_FORCE_RESET();
    HAL_Delay(100);
    __HAL_RCC_I2C1_RELEASE_RESET();
    HAL_Delay(100);
    MX_I2C1_Init();
    HAL_Delay(100);

    /* ── LCD init ────────────────────────────────────────────────────── */
    lcd_init();
    lcd_clear();

    /* ── WiFi web mirror on ESP8266 SoftAP ───────────────────────────── */
    lcd_show(0, "WiFi starting");
    lcd_show(1, WIFI_AP_SSID);
    Wifi_Enable();
    if (Wifi_Web_Start())
    {
        lcd_show(0, "WiFi Ready!");
        lcd_show(1, "192.168.4.1");
    }
    else
    {
        lcd_show(0, "WiFi Offline");
        lcd_show(1, "Auth only");
    }

    /* ── MPU6050 init on I2C2 (non-blocking, just disable tamper if it fails) */
    uint8_t mpu_ok = 0;
    int16_t accel_prev[3] = {0};
    int16_t gyro_prev[3]  = {0};
    uint32_t last_mpu_poll = 0;

    if (MPU6050_Init(&hi2c2, MPU6050_ACCEL_RANGE_8G, MPU6050_GYRO_RANGE_1000) == INIT_SUCCESS)
    {
        MPU6050_getAccelValue(&hi2c2, accel_prev);
        MPU6050_getGyroValue(&hi2c2, gyro_prev);
        mpu_ok = 1;
    }

    /* ── Fingerprint sensor init ─────────────────────────────────────── */
    lcd_show(0, "FP Init...");

    /* On cold boot the R307 sends an unsolicited startup notification into
     * the UART RX buffer. If we transmit a VerifyPassword while that startup
     * packet is still queued, our response stacks behind it and every later
     * command/response pair is misaligned. Drain it first.                */
    {
        uint8_t fp_flush[32];
        HAL_UART_Receive(&huart1, fp_flush, sizeof(fp_flush), 150);
    }

