Ibrahim-Touny/LockEn_STM32/Core/Src/main.c
    /* Retry up to 3 times — first attempt may hit the sensor's self-test. */
    uint8_t fp_ok = 0;
    for (int fp_try = 0; fp_try < 3 && !fp_ok; fp_try++)
    {
        if (R307_VerifyPassword(0x00000000) == HAL_OK)
        {
            fp_ok = 1;
        }
        else
        {
            HAL_Delay(300);
            uint8_t fp_retry_flush[32];
            HAL_UART_Receive(&huart1, fp_retry_flush, sizeof(fp_retry_flush), 50);
        }
    }

    if (!fp_ok)
    {
        lcd_show(0, "FP Init FAILED!");
        lcd_show(1, "Check sensor!");
        Buzzer_BeepDenied();
        Error_Handler();
    }

    lcd_show(0, "FP Ready!");
    Buzzer_Beep(80);
    HAL_Delay(1000);

    /* ════════════════════════════════════════════════════════════════════
     *  SETUP PHASE (also re-entered on reset button)
     * ════════════════════════════════════════════════════════════════════ */
SETUP:
    memset(AUTH_CARD, 0, sizeof(AUTH_CARD));
    memset(SAVED_PASSWORD, 0, sizeof(SAVED_PASSWORD));

    R307_ClearAllFingerprints();

    Setup_RegisterCard();
    Setup_EnrollFingerprints();
    Setup_RegisterPassword();

    lcd_clear();
    lcd_show(0, "Setup Done!");
    lcd_show(1, "Scan your card");
    HAL_Delay(2000);

    lcd_show_idle();

    /* Re-baseline MPU after physical setup activity */
    if (mpu_ok)
    {
        MPU6050_getAccelValue(&hi2c2, accel_prev);
        MPU6050_getGyroValue(&hi2c2, gyro_prev);
        last_mpu_poll = HAL_GetTick();
    }

    /* ════════════════════════════════════════════════════════════════════
     *  ACCESS CONTROL LOOP
     * ════════════════════════════════════════════════════════════════════ */
    while (1)
    {
        Wifi_Web_Poll();

        /* ── Reset button check ──────────────────────────────────────── */
        if (ResetButton_IsPressed())
        {
            HAL_Delay(50);
            if (ResetButton_IsPressed())
            {
                Solenoid_Lock();
                Buzzer_Beep(200);
                lcd_clear();
                lcd_show(0, "Resetting...");
                lcd_show(1, "Please wait");
                HAL_Delay(1500);

                /* MFRC522_Init() does a full chip software reset, clearing
                 * CommIrqReg. Without it, stale IRQ bits (e.g. TimerIRq) make
                 * MFRC522_ToCard() return MI_NOTAGERR immediately every time. */
                MFRC522_Init();
                HAL_Delay(100);
                goto SETUP;
            }
        }

        /* ── MPU6050 tamper poll while idle ──────────────────────────── */
        if (mpu_ok && (HAL_GetTick() - last_mpu_poll) >= MPU_POLL_PERIOD_MS)
        {
            last_mpu_poll = HAL_GetTick();
            if (MPU_CheckTamper(accel_prev, gyro_prev))
            {
                lcd_clear();
                lcd_show(0, "!! TAMPER !!");
                lcd_show(1, "Device moved");
                Buzzer_Alarm(TAMPER_ALARM_MS);
                lcd_show_idle();
                /* Re-baseline after alarm so we don't loop on residual motion */
                MPU6050_getAccelValue(&hi2c2, accel_prev);
                MPU6050_getGyroValue(&hi2c2, gyro_prev);
            }
        }

        /* ── STEP 1: Scan RFID card ──────────────────────────────────── */
        status = MFRC522_Request(PICC_REQIDL, str);
        if (status != MI_OK) { HAL_Delay(200); continue; }

        status = MFRC522_Anticoll(str);
        if (status != MI_OK) { HAL_Delay(200); continue; }

        memcpy(sNum, str, 5);

        if (memcmp(sNum, AUTH_CARD, 5) != 0)
        {
            /* Unknown card */
            lcd_clear();
            lcd_show(0, "Access Denied!");
            lcd_show(1, "Unknown Card");
            Buzzer_BeepDenied();
            HAL_Delay(2000);
            lcd_show_idle();
            continue;
        }

        /* Card matched */
        Buzzer_BeepOK();
        lcd_clear();
        lcd_show(0, "Card OK!");
        lcd_show(1, "Place finger...");
        HAL_Delay(1000);

        /* ── STEP 2: Fingerprint ─────────────────────────────────────── */
        uint16_t matched_id, score;
        HAL_StatusTypeDef fp_status = R307_Verify(&matched_id, &score);

        if (fp_status != HAL_OK)
        {
            lcd_clear();
            lcd_show(0, "Bad Fingerprint!");
            lcd_show(1, "Access Denied");
            Buzzer_BeepDenied();
            HAL_Delay(2000);
            lcd_show_idle();
            continue;
        }

        Buzzer_BeepOK();
        lcd_clear();
        lcd_show(0, "Finger OK!");
        lcd_show(1, "Enter Password:");
        HAL_Delay(1000);

        /* ── STEP 3: Password ────────────────────────────────────────── */
        uint8_t pass_ok = 0;

        for (int attempt = 1; attempt <= MAX_ATTEMPTS; attempt++)
        {
            char attempt_msg[17];
            snprintf(attempt_msg, sizeof(attempt_msg), "Pass (%d/%d):", attempt, MAX_ATTEMPTS);
            lcd_show(0, attempt_msg);
            lcd_show(1, "");

            char entered[PASSWORD_LEN + 1];
            get_password(entered, PASSWORD_LEN);

            if (strcmp(entered, SAVED_PASSWORD) == 0)
            {
                pass_ok = 1;
                break;
            }
            else
            {
                lcd_clear();
                lcd_show(0, "Wrong Password!");

                char remain[17];
                int left = MAX_ATTEMPTS - attempt;
                if (left > 0) snprintf(remain, sizeof(remain), "%d tries left", left);
                else          snprintf(remain, sizeof(remain), "Locked out!");
                lcd_show(1, remain);

                Buzzer_BeepDenied();
                HAL_Delay(1500);
            }
        }

        /* ── Final outcome ───────────────────────────────────────────── */
        lcd_clear();

        if (pass_ok)
        {
            lcd_show(0, "Access Granted!");
            lcd_show(1, "Welcome!");
            Buzzer_BeepGranted();

            Solenoid_Unlock();
            HAL_Delay(3000);
            Solenoid_Lock();
        }
        else
        {
            lcd_show(0, "Access Denied!");
            lcd_show(1, "Too many tries");
            Buzzer_Alarm(1500);
            HAL_Delay(1500);
        }

        /* RFID reset between transactions */
        HAL_Delay(100);
        MFRC522_Init();
        HAL_Delay(50);

        memset(str, 0, sizeof(str));
        memset(sNum, 0, sizeof(sNum));

        /* Re-baseline MPU since user just interacted with the device */
        if (mpu_ok)
        {
            MPU6050_getAccelValue(&hi2c2, accel_prev);
            MPU6050_getGyroValue(&hi2c2, gyro_prev);
            last_mpu_poll = HAL_GetTick();
        }

